CarroNetPhp/webservices/layum_teste.php

<SOAP-ENV:Envelope
        SOAP-ENV:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"
        xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
        xmlns:xsd="http://www.w3.org/2001/XMLSchema"
        xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
        xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"
        xmlns:si="http://soapinterop.org/xsd">
    <SOAP-ENV:Body>
        <ns1:locadora xmlns:ns1="http://testuri.org">
            <codigo>12</codigo>
        </ns1:locadora>
    </SOAP-ENV:Body>
</SOAP-ENV:Envelope>